defense/listings/streaming-input-message.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:stream="https://github.com/autermann/streaming-wps" xmlns:ows="http://www.opengis.net/ows/1.1" xmlns:wps="http://www.opengis.net/wps/1.0.0">
  <soap:Header>
    <wsa:RelatesTo RelationshipType="https://github.com/autermann/streaming-wps/needs">uuid:f31da315-bce3-4e26-8112-3ccf0ecf1ab5</wsa:RelatesTo>
    <wsa:MessageID>uuid:6a0e50c7-85c4-448c-962d-894c41c441bf</wsa:MessageID>
    <wsa:Action>https://github.com/autermann/streaming-wps/input</wsa:Action>
  </soap:Header>
  <soap:Body>
    <stream:InputMessage>
      <stream:ProcessID>uuid:c99e6f21-f0a0-4770-9615-db3501490f0a</stream:ProcessID>
      <stream:Inputs>
        <stream:ReferenceInput>
          <ows:Identifier>input3</ows:Identifier>
          <stream:Reference>
            <wsa:MessageID>uuid:f31da315-bce3-4e26-8112-3ccf0ecf1ab5</wsa:MessageID>
            <stream:Output>output1</stream:Output>
          </stream:Reference>
        </stream:ReferenceInput>
        <stream:StreamingInput>
          <ows:Identifier>input1</ows:Identifier>
          <wps:Data>
            <wps:LiteralData dataType="xs:string">input1</wps:LiteralData>
          </wps:Data>
        </stream:StreamingInput>
        <stream:StreamingInput>
          <ows:Identifier>input2</ows:Identifier>
          <wps:Data>
            <wps:ComplexData mimeType="application/xml" encoding="UTF-8">
              <hello>world</hello>
            </wps:ComplexData>
          </wps:Data>
        </stream:StreamingInput>
        <stream:StreamingInput>
          <ows:Identifier>input4</ows:Identifier>
          <wps:Reference>
            <wps:Reference xmlns:xlink="http://www.w3.org/1999/xlink" schema="http://schemas.opengis.net/gml/3.1.1/base/gml.xsd" xlink:href="http://geoprocessing.demo.52north.org:8080/geoserver/wfs?SERVICE=WFS&amp;VERSION=1.0.0&amp;REQUEST=GetFeature&amp;TYPENAME=topp:tasmania_roads&amp;SRS=EPSG:4326&amp;OUTPUTFORMAT=GML3" method="GET"/>
          </wps:Reference>
        </stream:StreamingInput>
        <stream:StreamingInput>
          <ows:Identifier>input5</ows:Identifier>
          <wps:Data>
            <wps:BoundingBoxData crs="EPSG:4326" dimensions="2">
              <ows:LowerCorner>52.2 7.0</ows:LowerCorner>
              <ows:UpperCorner>55.2 15.0</ows:UpperCorner>
            </wps:BoundingBoxData>
          </wps:Data>
        </stream:StreamingInput>
      </stream:Inputs>
    </stream:InputMessage>
  </soap:Body>
</soap:Envelope>